In [457]:
from sqlalchemy import create_engine
import pandas as pd
from warnings import filterwarnings
import pymysql
filterwarnings('ignore', category=pymysql.Warning)
import os
engine = create_engine('mysql+pymysql://root:kuCourage3@localhost/sakila')

In [458]:
def RunSQL(sql_command):
    connection = pymysql.connect(host='localhost',
                             user='root',
                             password='kuCourage3',
                             db='sakila',
                             charset='utf8mb4',
                             cursorclass=pymysql.cursors.DictCursor)
    try:
        with connection.cursor() as cursor:
            commands = sql_command.split(';')
            for command in commands:
                if command == '\n': continue
                cursor.execute(command + ';')
                connection.commit()
    except Exception as e: 
        print(e)
    finally:
        connection.close()

In [459]:
#1a
sql_query = """
select actor.actor_id, actor.first_name, actor.last_name from actor;
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head()

   actor_id first_name     last_name
0         1   PENELOPE       GUINESS
1         2       NICK      WAHLBERG
2         3         ED         CHASE
3         4   JENNIFER         DAVIS
4         5     JOHNNY  LOLLOBRIGIDA

In [460]:
#1b
sql_query = """
select UPPER(CONCAT(actor.first_name, ' ', actor.last_name)) AS `Actor Name` from actor;
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head()

            Actor Name
0     PENELOPE GUINESS
1        NICK WAHLBERG
2             ED CHASE
3       JENNIFER DAVIS
4  JOHNNY LOLLOBRIGIDA

In [461]:
#2a
sql_query = """
select actor.actor_id, actor.first_name, actor.last_name from actor
where actor.first_name = 'Joe';
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head()

   actor_id first_name last_name
0         9        JOE     SWANK

In [462]:
#2b
sql_query = """
select actor.last_name from actor
where actor.last_name like '%%GEN%%';
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head()

   last_name
0     BERGEN
1  DEGENERES
2  DEGENERES
3  DEGENERES

In [463]:
#2c
sql_query = """
select actor.last_name, actor.first_name from actor
where actor.last_name like '%%LI%%'
order by actor.last_name asc;
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head()

  last_name first_name
0   CHAPLIN       GREG
1     JOLIE      WOODY
2   OLIVIER       CUBA
3   OLIVIER     AUDREY
4  WILLIAMS       SEAN

In [464]:
#2d 
sql_query = """
select * 
from country
where country_id IN
(
  select country_id
  from country
  where country in ('Afghanistan', 'Bangladesh', 'China')
);
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head()

   country_id      country         last_update
0           1  Afghanistan 2006-02-15 04:44:00
1          12   Bangladesh 2006-02-15 04:44:00
2          23        China 2006-02-15 04:44:00

In [465]:
#3a Add a middle name column to the table actor. Position between first_name and last_name. Specify data type first!
actor = pd.read_sql_query('select * from actor', engine)
actor.head(1)

   actor_id first_name last_name         last_update
0         1   PENELOPE   GUINESS 2006-02-15 04:34:33

In [466]:
sql_query = """
ALTER TABLE actor ADD COLUMN middle_name varchar(30) AFTER first_name;
"""
RunSQL(sql_query)
actor = pd.read_sql_query('select * from actor', engine)
actor.head(1)

   actor_id first_name middle_name last_name         last_update
0         1   PENELOPE        None   GUINESS 2006-02-15 04:34:33

In [467]:
#3b Change data type of middle_name column to blob
sql_query = """
ALTER TABLE actor UPDATE COLUMN middle_name BLOB;

""" 
RunSQL(sql_query)
middle_name = pd.read_sql_query('select * from actor', engine)
middle_name.head(1)

(1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'UPDATE COLUMN middle_name BLOB' at line 1")

   actor_id first_name middle_name last_name         last_update
0         1   PENELOPE        None   GUINESS 2006-02-15 04:34:33

In [468]:
#3c Delete middle_name column
sql_query = """
ALTER TABLE actor DROP COLUMN middle_name; 

""" 
RunSQL(sql_query)
actor = pd.read_sql_query('select * from actor', engine)
actor.head(1)

(1065, 'Query was empty')

   actor_id first_name last_name         last_update
0         1   PENELOPE   GUINESS 2006-02-15 04:34:33

In [469]:
#4a https://www.w3resource.com/sql/aggregate-functions/count-with-group-by.php
sql_query = """
select actor.last_name, COUNT(*)
from actor
group by actor.last_name;
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head()

  last_name  COUNT(*)
0    AKROYD         3
1     ALLEN         3
2   ASTAIRE         1
3    BACALL         1
4    BAILEY         2

In [470]:
#4b
sql_query = """
select actor.last_name, COUNT(*) 
from actor
group by actor.last_name
having Count(*) > 1;
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head()

  last_name  COUNT(*)
0    AKROYD         3
1     ALLEN         3
2    BAILEY         2
3    BENING         2
4     BERRY         3

In [471]:
#4c
sql_query = """
 select actor_id, actor.first_name, actor.last_name from actor
 Where actor.first_name = 'Groucho';
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head()

   actor_id first_name last_name
0        78    GROUCHO   SINATRA
1       106    GROUCHO     DUNST

In [472]:
#4c https://www.techonthenet.com/sql/and_or.php
sql_query = """
UPDATE Table actor
SET first_name = 'HARPO'
WHERE first_name = 'GROUCHO' AND actor_id = '172';
"""
RunSQL(sql_query)
query_return = pd.read_sql_query(sql_query, engine)
query_return.head()

(1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'Table actor\nSET first_name = 'HARPO'\nWHERE first_name = 'GROUCHO' AND actor_id =' at line 1")

ProgrammingError: (pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'Table actor\nSET first_name = 'HARPO'\nWHERE first_name = 'GROUCHO' AND actor_id =' at line 1") [SQL: "\nUPDATE Table actor\nSET first_name = 'HARPO'\nWHERE first_name = 'GROUCHO' AND actor_id = '172';\n"]

In [473]:
#4d
sql_query = """
UPDATE Table actor
SET first_name = 'GROUCHO'
WHERE first_name = 'HARPO' AND actor_id = '172';
"""
RunSQL(sql_query)
query_return = pd.read_sql_query(sql_query, engine)
query_return.head()

(1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'Table actor\nSET first_name = 'GROUCHO'\nWHERE first_name = 'HARPO' AND actor_id =' at line 1")

ProgrammingError: (pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'Table actor\nSET first_name = 'GROUCHO'\nWHERE first_name = 'HARPO' AND actor_id =' at line 1") [SQL: "\nUPDATE Table actor\nSET first_name = 'GROUCHO'\nWHERE first_name = 'HARPO' AND actor_id = '172';\n"]

In [474]:
#rerun 4c -oops I think I permanently deleted it
sql_query = """
 select actor_id, actor.first_name, actor.last_name from actor
 Where actor.first_name = 'Groucho';
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head()

   actor_id first_name last_name
0        78    GROUCHO   SINATRA
1       106    GROUCHO     DUNST

In [479]:
#where is harpo? I can't get him back to Groucho. -1 pt!
sql_query = """
 select actor_id, actor.first_name, actor.last_name from actor
 Where actor.first_name = 'Harpo';
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head()

   actor_id first_name last_name
0       172      HARPO  WILLIAMS

In [480]:
#5a
sql_query = """
Show create table address;
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head()

     Table                                       Create Table
0  address  CREATE TABLE `address` (\n  `address_id` small...

In [481]:
#5a
sql_query = """
show index from address;
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head()

,Table,Non_unique,Key_name,Seq_in_index,Column_name,Collation,Cardinality,Sub_part,Packed,Null,Index_type,Comment,Index_comment
0,address,0,PRIMARY,1,address_id,A,603,NaN,None,,BTREE,,
1,address,1,idx_fk_city_id,1,city_id,A,599,NaN,None,,BTREE,,
2,address,1,idx_location,1,location,A,603,32.0,None,,SPATIAL,,

In [482]:
#6a
staff = pd.read_sql_query('select * from staff', engine)
staff.head()

,staff_id,first_name,last_name,address_id,picture,email,store_id,active,username,password,last_update
0,1,Mike,Hillyer,3,b'\x89PNG\r\n\x1a\n\x00\x00\x00\rIHDR\x00\x00\...,Mike.Hillyer@sakilastaff.com,1,1,Mike,8cb2237d0679ca88db6464eac60da96345513964,2006-02-15 03:57:16
1,2,Jon,Stephens,4,None,Jon.Stephens@sakilastaff.com,2,1,Jon,None,2006-02-15 03:57:16

In [483]:
address = pd.read_sql_query('select * from address', engine)
address.head()

,address_id,address,address2,district,city_id,postal_code,phone,location,last_update
0,1,47 MySakila Drive,None,Alberta,300,,,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00>\n2]c4\...,2014-09-25 22:30:27
1,2,28 MySQL Boulevard,None,QLD,576,,,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00\x8e\x10...,2014-09-25 22:30:09
2,3,23 Workhaven Lane,None,Alberta,300,,14033335568,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00\xcd\xc4...,2014-09-25 22:30:27
3,4,1411 Lillydale Drive,None,QLD,576,,6172235589,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00[\r\xe44...,2014-09-25 22:30:09
4,5,1913 Hanoi Way,,Nagasaki,463,35200,28303384290,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00(\xd17\x...,2014-09-25 22:31:53

In [486]:
#6a
sql_query = """
select address.address_id, staff.first_name, staff.last_name, address.address
from staff
inner join address
on address.address_id = staff.address_id;
"""

sample_query = pd.read_sql_query(sql_query, engine)
sample_query.head()

   address_id first_name last_name               address
0           3       Mike   Hillyer     23 Workhaven Lane
1           4        Jon  Stephens  1411 Lillydale Drive

In [487]:
#6b
payment = pd.read_sql_query('select * from payment', engine)
payment.head()

,payment_id,customer_id,staff_id,rental_id,amount,payment_date,last_update
0,1,1,1,76.0,2.99,2005-05-25 11:30:37,2006-02-15 22:12:30
1,2,1,1,573.0,0.99,2005-05-28 10:35:23,2006-02-15 22:12:30
2,3,1,1,1185.0,5.99,2005-06-15 00:54:12,2006-02-15 22:12:30
3,4,1,2,1422.0,0.99,2005-06-15 18:02:53,2006-02-15 22:12:30
4,5,1,2,1476.0,9.99,2005-06-15 21:08:46,2006-02-15 22:12:30

In [488]:
#6b START testing and building query
sql_query = """
select staff.staff_id, staff.first_name, staff.last_name, sum(payment.amount)
from staff
inner join payment

on payment.staff_id = staff.staff_id
group by staff.staff_id

;
"""

sample_query = pd.read_sql_query(sql_query, engine)
sample_query.head()

   staff_id first_name last_name  sum(payment.amount)
0         1       Mike   Hillyer             33489.47
1         2        Jon  Stephens             33927.04

In [489]:
#6b keep building query, need date and total amount for each staff. Completed!
#https://www.w3resource.com/sql/aggregate-functions/sum-function.php
sql_query = """
select staff.staff_id, staff.first_name, staff.last_name, sum(payment.amount) AS "Total Rung Up"
from staff
inner join payment
on payment.staff_id = staff.staff_id
WHERE payment.payment_date LIKE '%%05-08%%'
group by staff.staff_id

;
"""

sample_query = pd.read_sql_query(sql_query, engine)
sample_query.head()

   staff_id first_name last_name  Total Rung Up
0         1       Mike   Hillyer       11853.65
1         2        Jon  Stephens       12218.48

In [490]:
#6c
sql_query = """
select film.title as "Film", COUNT(*) as "Number of Actors"

from film
inner join film_actor

on film.film_id = film_actor.film_id
group by film.title

;
"""

sample_query = pd.read_sql_query(sql_query, engine)
sample_query.head()

               Film  Number of Actors
0  ACADEMY DINOSAUR                10
1    ACE GOLDFINGER                 4
2  ADAPTATION HOLES                 5
3  AFFAIR PREJUDICE                 5
4       AFRICAN EGG                 5

In [491]:
#6d
sql_query = """
select film.film_id, film.title, sum(inventory.store_id) AS "Number of Copies" 
from inventory
join film using (film_id)
where film.title = 'Hunchback Impossible';
"""
query_return = pd.read_sql_query(sql_query, engine)
query_return.head()

   film_id                 title  Number of Copies
0      439  HUNCHBACK IMPOSSIBLE               8.0

In [492]:
#6e
sql_query = """
select customer.customer_id, customer.first_name, customer.last_name, sum(payment.amount) AS "Total Paid"
from customer
inner join payment
on payment.customer_id = customer.customer_id
group by customer.last_name
order by customer.last_name asc;

"""

sample_query = pd.read_sql_query(sql_query, engine)
sample_query.head()

   customer_id first_name  last_name  Total Paid
0          505     RAFAEL      ABNEY       97.79
1          504  NATHANIEL       ADAM      133.72
2           36   KATHLEEN      ADAMS       92.73
3           96      DIANA  ALEXANDER      105.73
4          470     GORDON     ALLARD      160.68

In [493]:
#7a explore titles
sql_query = """
  SELECT *
  FROM film
  WHERE film.title LIKE 'Q%%' OR film.title LIKE 'K%%';
"""
QK = pd.read_sql_query(sql_query, engine)
QK.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,493,KANE EXORCIST,A Epic Documentary of a Composer And a Robot w...,2006,1,None,5,0.99,92,18.99,R,"Trailers,Commentaries",2006-02-15 05:03:42
1,494,KARATE MOON,A Astounding Yarn of a Womanizer And a Dog who...,2006,1,None,4,0.99,120,21.99,PG-13,Behind the Scenes,2006-02-15 05:03:42
2,495,KENTUCKIAN GIANT,A Stunning Yarn of a Woman And a Frisbee who m...,2006,1,None,5,2.99,169,10.99,PG,"Trailers,Commentaries,Deleted Scenes,Behind th...",2006-02-15 05:03:42
3,496,KICK SAVANNAH,A Emotional Drama of a Monkey And a Robot who ...,2006,1,None,3,0.99,179,10.99,PG-13,"Trailers,Commentaries,Deleted Scenes",2006-02-15 05:03:42
4,497,KILL BROTHERHOOD,A Touching Display of a Hunter And a Secret Ag...,2006,1,None,4,0.99,54,15.99,G,"Trailers,Commentaries",2006-02-15 05:03:42

In [494]:
language = pd.read_sql_query('select * from language', engine)
language.head()

   language_id      name         last_update
0            1   English 2006-02-15 05:02:19
1            2   Italian 2006-02-15 05:02:19
2            3  Japanese 2006-02-15 05:02:19
3            4  Mandarin 2006-02-15 05:02:19
4            5    French 2006-02-15 05:02:19

In [495]:
#7a
sql_query = """

SELECT *
FROM film
WHERE film.title LIKE 'Q%%' OR film.title LIKE 'K%%'
AND language_id IN

(
  Select language_id
  FROM language 
  Where language_id = 1
);

"""
QK = pd.read_sql_query(sql_query, engine)
QK.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,493,KANE EXORCIST,A Epic Documentary of a Composer And a Robot w...,2006,1,None,5,0.99,92,18.99,R,"Trailers,Commentaries",2006-02-15 05:03:42
1,494,KARATE MOON,A Astounding Yarn of a Womanizer And a Dog who...,2006,1,None,4,0.99,120,21.99,PG-13,Behind the Scenes,2006-02-15 05:03:42
2,495,KENTUCKIAN GIANT,A Stunning Yarn of a Woman And a Frisbee who m...,2006,1,None,5,2.99,169,10.99,PG,"Trailers,Commentaries,Deleted Scenes,Behind th...",2006-02-15 05:03:42
3,496,KICK SAVANNAH,A Emotional Drama of a Monkey And a Robot who ...,2006,1,None,3,0.99,179,10.99,PG-13,"Trailers,Commentaries,Deleted Scenes",2006-02-15 05:03:42
4,497,KILL BROTHERHOOD,A Touching Display of a Hunter And a Secret Ag...,2006,1,None,4,0.99,54,15.99,G,"Trailers,Commentaries",2006-02-15 05:03:42

In [496]:
#7b
sql_query = """

SELECT first_name, last_name
FROM actor
WHERE actor_id IN

(
  Select actor_id
  FROM film_actor
  Where film_id IN
  (
    Select film_id
    FROM film
    where film.title = 'Alone Trip'
  )
);

"""
aloneactors = pd.read_sql_query(sql_query, engine)
aloneactors.head()

  first_name last_name
0         ED     CHASE
1       KARL     BERRY
2        UMA      WOOD
3      WOODY     JOLIE
4    SPENCER      DEPP

In [497]:
#7c find country_id for Canada
sql_query = """
  SELECT country_id, country 
  FROM Country
  WHERE Country LIKE 'Can%%';
"""
Canada = pd.read_sql_query(sql_query, engine)
Canada.head()

   country_id country
0          20  Canada

In [498]:
#7c
sql_query = """
select customer_id, first_name, last_name, email
from customer
where customer_id IN
(
  select customer_id
  from address
  where address_id IN
  (
    select address_id 
    from city
    where city_id IN
    (
      select city_id
      from country
      where country_id = 20
    )
  )
);

"""

canada = pd.read_sql_query(sql_query, engine)
canada.head()

   customer_id first_name last_name                                email
0            1       MARY     SMITH        MARY.SMITH@sakilacustomer.org
1            2   PATRICIA   JOHNSON  PATRICIA.JOHNSON@sakilacustomer.org
2            3      LINDA  WILLIAMS    LINDA.WILLIAMS@sakilacustomer.org
3            4    BARBARA     JONES     BARBARA.JONES@sakilacustomer.org
4            5  ELIZABETH     BROWN   ELIZABETH.BROWN@sakilacustomer.org

In [499]:
#7d find film category_id for family
family = pd.read_sql_query('select * from category', engine)
family

    category_id         name         last_update
0             1       Action 2006-02-15 04:46:27
1             2    Animation 2006-02-15 04:46:27
2             3     Children 2006-02-15 04:46:27
3             4     Classics 2006-02-15 04:46:27
4             5       Comedy 2006-02-15 04:46:27
5             6  Documentary 2006-02-15 04:46:27
6             7        Drama 2006-02-15 04:46:27
7             8       Family 2006-02-15 04:46:27
8             9      Foreign 2006-02-15 04:46:27
9            10        Games 2006-02-15 04:46:27
10           11       Horror 2006-02-15 04:46:27
11           12        Music 2006-02-15 04:46:27
12           13          New 2006-02-15 04:46:27
13           14       Sci-Fi 2006-02-15 04:46:27
14           15       Sports 2006-02-15 04:46:27
15           16       Travel 2006-02-15 04:46:27

In [500]:
#7d
sql_query = """
select film_text.title AS "Family Film"
from film_category
inner join film_text
on film_text.film_id = film_category.film_id
Where category_id = 8;
"""
family = pd.read_sql_query(sql_query, engine)
family.head()

       Family Film
0      AFRICAN EGG
1    APACHE DIVINE
2   ATLANTIS CAUSE
3  BAKED CLEOPATRA
4        BANG KWAI

In [501]:
titles = pd.read_sql_query('select * from film', engine)
titles.head(1)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42

In [503]:
#7e most frequently rented movies in descending order. This one was hard and took a long time. Once I got it. I ripped
sql_query = """
SELECT 
    film.title AS "Title", 
    count(rental_id) as "Times Rented"
FROM
    Rental
INNER JOIN
    inventory on inventory.inventory_id = rental.inventory_id
INNER JOIN
    film on inventory.film_id = film.film_id
group by film.title
order by count(rental_id) desc
;
 
"""

customer_rental = pd.read_sql_query(sql_query, engine)
customer_rental.head()

                Title  Times Rented
0  BUCKET BROTHERHOOD            34
1    ROCKETEER MOTHER            33
2      JUGGLER HARDLY            32
3       SCALAWAG DUCK            32
4      GRIT CLOCKWORK            32

In [504]:
#7f
sql_query = """
SELECT 
    store.store_id AS "Store Number", 
    sum(payment.amount) as "Revenue"
FROM
    Store
INNER JOIN
    inventory on store.store_id = inventory.store_id
INNER JOIN
    rental on inventory.inventory_id = rental.inventory_id
INNER JOIN
    payment on rental.rental_id = payment.rental_id
group by store.store_id

;
 
"""

store_income = pd.read_sql_query(sql_query, engine)
store_income.head()

   Store Number   Revenue
0             1  33679.79
1             2  33726.77

In [505]:
#7f There are only 2 stores? yes! moving on..
stores = pd.read_sql_query('select * from store', engine)
stores.head()

   store_id  manager_staff_id  address_id         last_update
0         1                 1           1 2006-02-15 04:57:12
1         2                 2           2 2006-02-15 04:57:12

In [506]:
#7g
sql_query = """
  SELECT store_id AS "Store",
  city.city AS "City",
  country.country AS "Country" 
FROM
    Store
INNER JOIN
    address on store.address_id = address.address_id
INNER JOIN
    city on address.city_id = city.city_id
INNER JOIN
    country on city.country_id = country.country_id
group by store.store_id  
  ;
"""
Canada = pd.read_sql_query(sql_query, engine)
Canada.head()

   Store        City    Country
0      1  Lethbridge     Canada
1      2   Woodridge  Australia

In [507]:
#7h
sql_query = """
  SELECT category.name AS "Genre",
  sum(payment.amount) as "Revenue"
FROM
    category
INNER JOIN
    film_category on category.category_id = film_category.category_id
INNER JOIN
    inventory on film_category.film_id = inventory.film_id
INNER JOIN
    rental on inventory.inventory_id = rental.inventory_id
INNER JOIN
    payment on rental.rental_id = payment.rental_id
group by category.name
order by sum(payment.amount) desc
;
"""
genre = pd.read_sql_query(sql_query, engine)
genre.head()

       Genre  Revenue
0     Sports  5314.21
1     Sci-Fi  4756.98
2  Animation  4656.30
3      Drama  4587.39
4     Comedy  4383.58

In [508]:
#8a
sql_query = """
create view genre as
SELECT category.name AS "Genre",
  sum(payment.amount) as "Revenue"
FROM
    category
INNER JOIN
    film_category on category.category_id = film_category.category_id
INNER JOIN
    inventory on film_category.film_id = inventory.film_id
INNER JOIN
    rental on inventory.inventory_id = rental.inventory_id
INNER JOIN
    payment on rental.rental_id = payment.rental_id
group by category.name
order by sum(payment.amount) desc
"""
RunSQL(sql_query)

In [509]:
sql_query = """
DROP view genre 

"""
RunSQL(sql_query)